# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyBoolean..::..Value Property
AssetPropertyBoolean Class See Also
---
The value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Value {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input value is invalid for this AssetPropertyBoolean property. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The asset property is not editable. |

# See Also
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace